### groupby()

In [143]:
np.random.seed(0)
df2 = pd.DataFrame({
    'key1':['A','A','B','B','A'],
    'key2' : ['one','two','one','two','one'],
    'data1' :[1,2,3,4,5],
    'data2' :[10,20,30,40,50]
})
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [145]:
groups = df2.groupby(df2.key1)
groups.groups

{'A': [0, 1, 4], 'B': [2, 3]}

In [148]:
groups.sum() # key1을 기준으로 동일한 값 더해준다

      data1  data2
key1
A         8     80
B         7     70

In [147]:
df2.data1.groupby(df2.key1).sum()

key1
A    8
B    7
Name: data1, dtype: int64

In [151]:
df2.groupby(df2.key1)['data2'].sum()
df2.groupby(df2.key1).sum()['data2']

key1
A    80
B    70
Name: data2, dtype: int64

In [152]:
df2.data1.groupby([df2.key1,df2.key2]).sum()

key1  key2
A     one     6
      two     2
B     one     3
      two     4
Name: data1, dtype: int64